Revit 2026 API

# ImportColorMode Enumeration

---

An enumerated type listing how colors are handled in an import process.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ImportColorMode
```
```vb
Public Enumeration ImportColorMode
```
```cpp
public enum class ImportColorMode
```
```fsharp
type ImportColorMode
```

| Member name | Value | Description |
| --- | --- | --- |
| BlackAndWhite | 2 | Colors in the imported drawing are converted to Black and White. |
| Inverted | 1 | Colors in the imported drawing are inverted. |
| Preserved | 0 | Colors in the imported drawing are preserved. |

#### Reference

Autodesk.Revit.DB Namespace